---
kind: method
id: M:Autodesk.Revit.DB.UpdaterId.GetAddInId
source: html/7ee77980-7354-632d-76f3-b9d496704bc4.htm
---
# Autodesk.Revit.DB.UpdaterId.GetAddInId Method

AddInId of the UpdaterId

## Syntax (C#)
```csharp
public AddInId GetAddInId()
```